Attribute VB_Name = "Template_WebAPI"
'***************************************************************************************************
'                       WebAPIの基礎を組む際のテンプレートです
'           より詳しいドキュメントは、https://vba-tools.github.io/VBA-Web/docs/　へ
'***************************************************************************************************
Option Explicit



'***************************************************************************************************
'                              ■■■ 接続情報や固定情報など ■■■
'***************************************************************************************************
Const EndPointURL       As String = "https://なんちゃら"
Const DefaultUserAgent  As String = "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36 Edg/143.0.0.0"



'***************************************************************************************************
'                           ■■■ リクエスト時の共通設定処理 ■■■
'***************************************************************************************************
'* 機能　　：事前に設定したパラメーターを元に、共通設定を施して、APIアクセスを行います
'---------------------------------------------------------------------------------------------------
'* 返り値　：クラスオブジェクト - WebResponse    ここに結果が格納されます
'* 引数　　：クラスオブジェクト - WebRequest     事前に設定したリクエストパラメーター一式
'---------------------------------------------------------------------------------------------------
'* 詳細説明：アクセスTokenやcookieなど、どのリクエストに対しても必要なヘッダー等をここで設定します
'* 注意事項：サブドメイン仕様の場合は、一工夫必要です
'***************************************************************************************************
Private Function ホストへリクエスト(リクエスト情報一式 As WebRequest) As WebResponse
    '通信の設定
    Dim EndPointAPI As New WebClient
    With EndPointAPI
        'ホスト名URL
        .BaseUrl = EndPointURL
        
        'リダイレクト先まで追従するか？
        .FollowRedirects = True
        
        'タイムアウト設定(AIなどで、レスポンスが来るまで時間がかかるのが分かってる場合。デフォルトは、5000ms)
        .TimeoutMS = 10000
    End With

    '共通のヘッダーを施します
    With リクエスト情報一式
        '認証トークンなど
'        .AddHeader "authorization", "Bearer XXX"
'        .AddCookie "session", "YYY"

        'ユーザーエージェントを指定
        .UserAgent = DefaultUserAgent
    End With

    '事前設定と共通設定を使ってリクエストし、結果を返します
    Set ホストへリクエスト = EndPointAPI.Execute(リクエスト情報一式)
End Function



'***************************************************************************************************
'                               ■■■ リクエスト定義 ■■■
'***************************************************************************************************
'* 機能　　：
'---------------------------------------------------------------------------------------------------
'* 返り値　：クラスオブジェクト - WebResponse    ここに結果が格納されます
'* 引数　　：
'---------------------------------------------------------------------------------------------------
'* 詳細説明：
'* 注意事項：
'***************************************************************************************************
Function Get_hoge(OrderId As Long) As WebResponse
    'リクエストパラメーターを設定する
    Dim リクエスト情報一式 As WebRequest: Set リクエスト情報一式 = New WebRequest
    With リクエスト情報一式
        'GET
        .Method = vbWebHttpGet

        'レスポンスのデータ形式を指定
        .ResponseFormat = vbWebFormatPlainText

        'リクエストのデータ形式を指定(基本は、POST の時に指定)
        '.RequestFormat = vbWebFormatJson

        'パスパラメーターを指定(ホスト名に続くURL)
        .Resource = "/{OrderId}/hoge"
        .AddUrlSegment "OrderId", OrderId             'セグメント(中カッコ内)部分に動的な割り当てとかできます。

        'あとは必要に応じた設定など...　詳細は、ドキュメントをどうぞ


    End With

    'リクエストして、結果を返す
    Set Get_hoge = ホストへリクエスト(リクエスト情報一式)
End Function
